Revit 2027 API
StairsRunType.StructuralDepth Property
 The structural depth of the stairs run, only available for monolithic stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StructuralDepth { get; set; }
Public Property StructuralDepth As Double
	Get
	Set
public:
property double StructuralDepth {
	double get ();
	void set (double value);
}
member StructuralDepth : float with get, set
Property Value
Double
 The structural depth of the stairs run, 0.0 if the stairs run is not monolithic.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for structuralDepth must be between 0 and 30000 feet.
InvalidOperationException |  When setting this property: The stairs run type is not a monolithic type so the data being set is not applicable.
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace